Revit 2027 API
PathReinforcementType.CreateDefaultPathReinforcementType Method
 Creates a new PathReinforcementType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateDefaultPathReinforcementType(
	Document ADoc
)
Public Shared Function CreateDefaultPathReinforcementType (
	ADoc As Document
) As ElementId
public:
static ElementId^ CreateDefaultPathReinforcementType(
	Document^ ADoc
)
static member CreateDefaultPathReinforcementType :
        ADoc : Document -> ElementId
Parameters
ADoc Document
 The document.
Return Value
ElementId
 The newly created type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PathReinforcementType Class
Autodesk.Revit.DB.Structure Namespace